app/views/admin/index.slim

SELECT "schedules".* FROM "schedules"
---
  .input-field
    select name="schedule" = options_from_collection_for_select Schedule.all, :id, :name