app/views/menu_items/listview.slim

SELECT "menu_items".* FROM "menu_items"
---
- MenuItem.all.each do |p|