app/views/index/index.html.slim

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      h5 Schedule
      = Schedule.find(Setting.schedule.to_i).contents.gsub("\n","<br>").html_safe
    .divider
    .section height="100%"