app/views/posts/listview.slim

SELECT "posts".* FROM "posts"
---
- Post.all.reverse.each do |p|