app/controllers/menu_items_controller.rb

  def index
    @menu_items = MenuItem.all
---
SELECT "menu_items".* FROM "menu_items"

  def show
    respond_to do |format|
      format.html {}
      format.json { render json: MenuItem.find(params[:id]), layout: false}
---
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
    @menu_item = MenuItem.new(menu_item_params)

    respond_to do |format|
      if @menu_item.save
---
INSERT INTO "menu_items" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lunch"], ["price", 375], ["created_at", 2017-02-18 02:36:32 UTC], ["updated_at", 2017-02-18 02:36:32 UTC]]

  def update
    respond_to do |format|
      if @menu_item.update(menu_item_params)
---
UPDATE "menu_items" SET "price" = ?, "updated_at" = ? WHERE "menu_items"."id" = ?  [["price", 150], ["updated_at", 2017-02-18 02:37:56 UTC], ["id", 5]]

  def destroy
    @menu_item.destroy
---
DELETE FROM "menu_items" WHERE "menu_items"."id" = ?  [["id", 6]]

    def set_menu_item
      @menu_item = MenuItem.find(params[:id])
---
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]