app/controllers/posts_controller.rb

  def show
    respond_to do |format|
      format.html {}
      format.json { render json: Post.find(params[:id]), layout: false}
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The title"], ["author", "The author"], ["content", "The content"], ["created_at", 2017-02-17 23:28:40 UTC], ["updated_at", 2017-02-17 23:28:40 UTC]]