app/controllers/schedules_controller.rb

  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save
---
INSERT INTO "schedules" ("name", "contents", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @schedule.update(schedule_params)
---
UPDATE "schedules" SET "contents" = ?, "updated_at" = ? WHERE "schedules"."id" = ?